## Production: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| add    | `module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth` |
| update | `module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda`  |
|        | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.sentinel_forwarder.data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:806545929748:log-group:/aws/lambda/sentinel-cloud-watch-forwarder:*",
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda will be updated in-place
  ~ resource "aws_iam_policy" "sentinel_forwarder_lambda" {
        id        = "arn:aws:iam::806545929748:policy/SentinelForwarderLambda-sentinel-cloud-watch-forwarder"
        name      = "SentinelForwarderLambda-sentinel-cloud-watch-forwarder"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:806545929748:log-group:/aws/lambda/sentinel-cloud-watch-forwarder:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
      - code_signing_config_arn        = "" -> null
        id                             = "sentinel-cloud-watch-forwarder"
      - image_uri                      = "" -> null
      - kms_key_arn                    = "" -> null
      ~ last_modified                  = "2022-11-24T12:49:15.621+0000" -> (known after apply)
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
      ~ source_code_hash               = "liR4yJNhp6SJtCjkSwnH0xGC0q00Uxebs1Cyqv8JLDw=" -> "mfdZfYUgPWLo+yh9aU8f33p2Tg+J0YOaJr3kKgPNVhE="
        tags                           = {
            "CostCentre" = "scan-files-production"
        }
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CUSTOMER_ID" = (sensitive value)
              - "LOG_TYPE"    = "ApplicationLog"
              - "SHARED_KEY"  = (sensitive value)
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth will be created
  + resource "aws_ssm_parameter" "sentinel_forwarder_auth" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "sentinel_forwarder_auth"
      + tags           = {
          + "CostCentre" = "scan-files-production"
        }
      + tags_all       = {
          + "CostCentre" = "scan-files-production"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_health_check_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.s3_scan_object_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_files_error[\"api\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_files_error[\"api-provisioned\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_files_warning[\"api\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_files_warning[\"api-provisioned\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_verdict_unknown[\"api\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.scan_verdict_unknown[\"api-provisioned\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_warning_us_east"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_ssm_parameter.sentinel_forwarder_auth"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.s3_scan_object_error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scan_verdict_unknown[\"api\"]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid:...
```

</details>
